{
    "mess": {
        "house": "\nYou are in the living room in your family house in Khayda. It is a clear as a day because it is, in fact, a day and there are no clouds on the horizon.",
        "village": "\nYou find yourself near the chief's hut in the village of Khayda. There is also a market and an alchemist's hut nearby.",
        "lake": "\nYou walk along a clear lake. Now it is ... clear to you why it is called that way.",
        "forest": "\nYou find yourself in a nearby forest. The sheer size of the trees and thick shrubbery make it hard for you to distinguish anything distant.",
        "fields": "\nYou wonder through the wheat fields near Khayda. There are several huts and farmers are harvesting crops here.",
        "mine": "\nYou are in an abandoned mine. You can see old equipment left behind, as if miners left in haste. You wonder what has happened to the people working here.",
        "lair": "\nYou hear something crunching underneath your feet. As you look down, you see a trail of skulls and bones leading towards a nest-like structure on the ground.",
        "market": "\nYou stand if front of the best-looking merchant in the market. 'How can I be of service?' He asks.\nEnter 1 to trade [trade]\nEnter 2 to return to the village",
        "alchemist": "\nYou slowly open the hut's door and immediately a strong smell of a mysterious liquid and wolfsbane hits you. In front of you stands a mysteriously looking woman.\nEnter 1 to talk to her [talk]\nEnter 2 to return to the village",
        "alchemtalk": "\n'Hmm... I don't remember your face. What is it that you want?' she asks.\nEnter 1 to ask her about local legends\nEnter 2 to return to the village",
        "alchemtalk2": "\n'Ah yes, the legend. We had to explain all the misfortune that has been happening around here in some way. We call him Zandalar.\nHe's voidborn and he's been terrorizing our village since I was a little girl. The wheatworm infestation of our fields, for example, is his doing.\nAll who tried to stop him failed as they didn't have the item needed.'\nEnter 1 to ask what is she talking about\nEnter 2 to return to the village",
        "alchemtalk3": "\n'You stand no chance against him, unless you wield Zandalar's staff. It is said that his brother Alberimus stole the Staff when he discovered Zandalar's plans\nto rule the world. Alberimus was then imprisoned by his own brother and the location of the Staff remains a mystery.'\nEnter 1 to ask her how can you find it",
        "alchemtalk4": "\nBefore Alberimus got imprisoned, he left behind a shard. That shard should teleport anyone - and anything - to Alberimus. In some wierd turn of events\nI managed to obtain said Shard. I will give it to you, but you have to slay a monster we call Sargelaz and bring me it's head as a proof.\nIt has made it's lair on a lake's shore, near the forest there. I can't give it to you for free and this beast has been blocking the only trade route here.'\nEnter 1 to ask her to repeat what she just said because you got distracted by a fly\nEnter 2 to assure her you will bring her the head and return to the village",
        "alchemist2": "\n'So, have you brought it's head? I guess we're about to see...'\nEnter 1 to ask the alchemist about the local legend\nEnter 2 to offer her Sargelaz's head\nEnter 3 to return to the village",
        "alchemist3": "\n'Thank you for defeating the monster. Have you used the Shard yet by any chance?'\nYou can do so by typing 'prison' after entering the command 'chooseloc'.\nEnter 1 to return to the village",
        "chief": "\nAs soon as you open the majestic doors that lead into the chief's home, you are greeted by the chief's friendly voice:'Hello fellow townsman.\nYou seem like a foreigner, strange... we haven't had one since... the accident...'\nEnter 1 to let him continue speaking [talk]\nEnter 2 to return to the village",
        "talkchief": "\n'I suppose I could tell you something useful.' he continues. 'If you venture outside the village - though I would not advise you to - you will face danger,\nthe forest is full of wolves, the fields are being ravaged by the wheatworms, our lake is inhabited by venomous snakes and nearby mine is crawling with spiders.'\nEnter 1 to let him continue speaking\nEnter 2 to return to the village",
        "talkchief2": "\n'If you didn't know, in this land we don't fight physically. Instead, we play a game known as 'Nim': the players take turns in removing 1 - 3 stones from\none pile of 21 stones. The player, who first gets the amount of stones to 0, wins. If you win, your opponent's soul should offer you some goods.\nAs a foreigner, you will never go first, however if you lose, you will only get hurt.\nTo read this again, while not in combat, not trading nor talking, just enter 'combat'.\nEnter 1 to ask about local legends\nEnter 2 to ask the chief to repeat what he just said because you were not paying attention\nEnter 3 to return to the village",
        "talkchief3": "\n'Ah yes, local legends, of course, I knew you would be interested. There is said to be an ancient tool of immense power,\nit is also said to be able to add one stone mid-fight, not replacing the player's turn, meaning that with enough skill and this item,\none cannot possibly loose a fight. Ask our alchemist, she might know more.'\nEnter 1 to ask the chief to repeat what he just said because you fell asleep\nEnter 2 to return to the village",
        "prison": "\nAs your eyes adjust to the dim light, you begin to see several cells, containing mostly horrifiyng skeletons.\nIn one of them however, you see an old pale man with dark hair who seems very lonely. An axe is nearby.\nThere are stairs leading up onto the surface, allowing strange dark orange light into the prison.",
        "chapel": "\nYou find yourself in a majestic building, probably the only one left untouched by the Void. You see an altar in the main wing.\nThere are whispers coming your way or maybe it is just the echo.",
        "park": "\nShiver runs down your spine as you walk through the worst-looking park you have ever been to.\nTrees twisted as if tormented, grass dry and of violet color, nothing here resembles happiness.",
        "theater": "\nYou see an old theater down the street, it's walls and stairs all crumbling under the pressure of time.\n'This one's not for playing.' you whisper to yourself.",
        "center": "\nThe center of this so-called city is as old as humanity itself and the ancient buildings serving unknown purposes somehow make you feel uncomfortable.",
        "alb": "\nBefore you can step on the first step of the stairs, the pale man calls you faintly: 'So... you have come. After so many years.\nI am Alberimus, the one who everyone must meet before their end. Before you continue in your journey, let me tell you your destiny.\nYou shall defeat my evil brother Zandalar with his own staff. It is hidden in a secret stash in the Chapel of Lizul, our father.\nIn order to unlock it, you need to place a void talon, an abyssal scope and a shadow blade in its proximity. All of these items you can obtain\nby slaying foes in this town called Talematros. Our family lived here, but when my brother got corrupted by the Void, so did this city. Now, you shall cleanse it.'\nEnter 1 to continue",
        "altar": "\nYou see several empty spaces on the altar, as if there was something missing. 'Those must be the things Alberimus spoke of.' you say to yourself.\nEnter 1 to deposit what is needed (a void talon, an abyssal scope, a shadow blade)\nEnter 2 to return to the chapel",
        "altar2": "You see an altar on top of which is an opened cache which used to hold Zandalar's staff. Nothing else to see here.",
        "bossfight": null
    },
    "house": {
        "place": "house",
        "opts": {
            "village": "village"
        }
    },
    "village": {
        "place": "village",
        "opts": {
            "house": "house",
            "mine": "mine",
            "fields": "fields",
            "market": "market",
            "alchemist": "alchemist",
            "chief": "chief"
        }
    },
    "lake": {
        "place": "lake",
        "opts": {
            "fields": "fields",
            "lair": "lair"
        }
    },
    "forest": {
        "place": "forest",
        "opts": {
            "mine": "mine",
            "lair": "lair"
        }
    },
    "fields": {
        "place": "fields",
        "opts": {
            "village": "village",
            "lake": "lake"
        }
    },
    "mine": {
        "place": "mine",
        "opts": {
            "village": "village",
            "forest": "forest"
        }
    },
    "lair": {
        "place": "lair",
        "opts": {
            "forest": "forest",
            "lake": "lake"
        }
    },
    "chief": {
        "place": "chief",
        "opts": {
            "1": "talkchief",
            "2": "village"
        }
    },
    "talkchief": {
        "place": null,
        "opts": {
            "1": "talkchief2",
            "2": "village"
        }
    },
    "talkchief2": {
        "place": null,
        "opts": {
            "1": "talkchief3",
            "2": "talkchief2",
            "3": "village"
        }
    },
    "talkchief3": {
        "place": null,
        "opts": {
            "1": "talkchief3",
            "2": "village"
        }
    },
    "market": {
        "place": "market",
        "opts": {
            "1": "trade",
            "2": "village"
        }
    },
    "alchemist": {
        "place": "alchemist",
        "opts": {
            "1": "alchemtalk",
            "2": "village"
        }
    },
    "alchemtalk": {
        "place": null,
        "opts": {
            "1": "alchemtalk2",
            "2": "village"
        }
    },
    "alchemtalk2": {
        "place": null,
        "opts": {
            "1": "alchemtalk3",
            "2": "village"
        }
    },
    "alchemtalk3": {
        "place": null,
        "opts": {
            "1": "alchemtalk4"
        }
    },
    "alchemtalk4": {
        "place": null,
        "opts": {
            "1": "alchemtalk4",
            "2": "village"
        }
    },
    "alchemist2": {
        "place": "alchemist",
        "opts": {
            "1": "alchemtalk2",
            "2": "trade",
            "3": "village"
        }
    },
    "alchemist3": {
        "place": "alchemist",
        "opts": {
            "1": "village"
        }
    },
    "prison": {
        "place": "prison",
        "opts": {
            "village": "village",
            "park": "park",
            "theater": "theater"
        }
    },
    "park": {
        "place": "park",
        "opts": {
            "prison": "prison",
            "center": "center"
        }
    },
    "center": {
        "place": "center",
        "opts": {
            "chapel": "chapel",
            "park": "park",
            "theater": "theater"
        }
    },
    "theater": {
        "place": "theater",
        "opts": {
            "prison": "prison",
            "center": "center"
        }
    },
    "alb": {
        "place": null,
        "opts": {
            "1": "prison"
        }
    },
    "chapel": {
        "place": "chapel",
        "opts": {
            "altar": "altar",
            "center": "center"
        }
    },
    "altar": {
        "place": "altar",
        "opts": {
            "1": "trade",
            "2": "chapel"
        }
    },
    "altar2": {
        "place": "altar2",
        "opts": {
            "chapel": "chapel"
        }
    },
    "bossfight": {
        "place": "bossfight",
        "opts": {
            "village": "village"
        }
    }
}