{
    "mess":{
        "house":"You find yourself in your family house in Khayda. It is a clear day, no bad weather in sight.",
        "village":"You find yourself near the chief's hut in the village of Khayda. There is a market and an alchemist's hut nearby.",
        "lake":"You find yourself in the proximity of a clear lake. Now it is ... clear to you why it is called that way.",
        "forest":"You find yourself in a nearby forest. The sheer size of the trees make it hard for you to distinguish anything distant.",
        "fields":"You find yourself in the wheat fields near Khayda. There are several huts and farmers are harvesting crops here.",
        "mine":"You crawl into an abandoned mine. You can see old equipment left behind, as if miners left in haste.",
        "market":"You stand if front of the best-looking merchant in the market. 'How can I be of service?' He asks.\nEnter 1 to trade\nEnter 2 to return to the village",
        "alchemist":"You slowly open the hut's door and immediately a strong smell of something being cooked hits you. In front of you stands a mysteriously looking woman.\nShe wispers 'Can I help you?'\nEnter 1 to talk\nEnter 2 to return to the village",
        "chiefhut":"As soon as you open the majestic doors that lead into the chief's hut, you are greeted by the chief's friendly voice:'Hello fellow townsman.\nYou seem like a foreigner, strange... we haven't had one since... the accident...'\nEnter 1 to let him continue speaking\nEnter 2 to return to the village",
        "talkchief":"'I suppose I could tell you something useful.' he continues. 'If you venture outside the village - I would not advise you to - you will face danger,\nthe forest is full of wolves, the fields are being ravaged by the wheatworms, our lake is inhabited by venomous snakes and nearby mine is crawling with spiders.'\nEnter 1 to let him continue speaking\nEnter 2 to return to the village",
        "talkchief2":"'If you didn't know, in this land we don't fight physically. Instead, we play a game known as 'Nim': the players take turns in removing 1 - 3 stones from\none pile of 21 stones. The player, who first gets the amount of stones to 0, wins. If you win, your opponent's soul should offer you some goods.\nHowever if you lose, you will only get hurt. To read this message again, just enter 'combat'.\nEnter 1 to ask about local legends\nEnter 2 to ask the chief to repeat what he just said because you weren't paying attention\nEnter 3 to return to the village",
        "talkchief3":"'Ah yes, local legends, of course, I knew you would be interested. There is said to be an ancient tool of immense power,\nit is also said to be able to add one stone mid-fight, not replacing the player's turn, meaning that with enough skill and this item,\none cannot possibly loose a fight. Our alchemist might know more.'\nEnter 1 to ask the chief to repeat what he just said because you fell asleep\nEnter 2 to return to the village"
    },
    "house":{
        "counter":1,
        "place":"house",
        "opts":{
            "village":"village"
        }
    },
    "village":{
        "counter":2,
        "place":"village",
        "opts":{
            "house":"house",
            "lake":"lake",
            "forest":"forest",
            "fields":"fields",
            "mine":"mine",
            "market":"market",
            "alchemist":"alchemist",
            "chiefhut":"chiefhut"
        }
    },
    "lake":{
        "counter":2,
        "place":"lake",
        "opts":{
            "village":"village",
            "forest":"forest",
            "fields":"fields",
            "mine":"mine"
        }
    },
    "forest":{
        "counter":2,
        "place":"forest",
        "opts":{
            "village":"village",
            "lake":"lake",
            "fields":"fields",
            "mine":"mine"
        }
    },
    "fields":{
        "counter":2,
        "place":"fields",
        "opts":{
            "village":"village",
            "lake":"lake",
            "forest":"forest",
            "mine":"mine"
        }
    },
    "mine":{
        "counter":2,
        "place":"mine",
        "opts":{
            "village":"village",
            "lake":"lake",
            "forest":"forest",
            "fields":"fields"
        }
    },
    "chiefhut":{
        "counter":2,
        "place":"chiefhut",
        "opts":{
            "1":"talkchief",
            "2":"village"
        }
    },
    "talkchief":{
        "counter":null,
        "place":null,
        "opts":{
            "1":"talkchief2",
            "2":"village"
        }
    },
    "talkchief2":{
        "counter":null,
        "place":null,
        "opts":{
            "1":"talkchief3",
            "2":"talkchief2",
            "3":"village"
        }
    },
    "talkchief3":{
        "counter":null,
        "place":null,
        "opts":{
            "1":"talkchief3",
            "2":"village"
        }
    },
    "market":{
        "counter":2,
        "place":"market",
        "opts":{
            "village":"village"
        }
    },
    "alchemist":{
        "counter":2,
        "place":"alchemist",
        "opts":{
            "village":"village"
        }
    }
}
