{
    "1": "'{},",
    "2": "you might not remember much from our last trip, so here are the basics. I am sure you will learn the rest in due time.",
    "3": "Your family has long lived in Khayda, a village located west of Kor-Shakal, the capital of Kherissean kingdom.",
    "4": "You are a son of a war hero. That war happened when our neighbours, The Acarian empire, claimed some of our lands.",
    "5": "Your father fought well, he has slain many enemies, including the famous Acarian war general, Ijaquam Lizul.",
    "6": "His current whereabouts are ...unknown, your only other living family member is your sister living in Kor-Shakal.'",
    "7": "The Infestation's growth is increasing by the minute! Ask the village's chief for a key, I have hidden a chest with some basic gear in the forest.",
    "8": "It's under a huge oak, though when I was there I heard some strange noise, be careful out there. When you are ready I will seek you out.'",
    "9": "The letter ends unsigned.\n",
    "10": "In this strange land, your enemies will try to kill you not physically, but mentally. Instead of fighting with swords and bows,",
    "11": "they play a game known as 'Nim'. Players remove 1-3 stones on each turn from a pile of 21 stones that magically appears",
    "12": "whenever a duel starts. As you are a stranger in this land, you always go second, but you never die from a single fight.",
    "13": "The goal is to get the pile to 0 and whoever does so, subjugates the opponents soul, gianing it's strengh and recieving what he has to offer.",
    "14": "Your current objective is: ",
    "15": "You have healed yourself for {}, you now have {} health.",
    "16": "You do not own such item.",
    "17": "{} {}(s)",
    "18": "In your inventory, there are: ",
    "19": "You have {} health.",
    "20": "Your location is '{}'.",
    "21": "Your options are '{}' and '{}'.",
    "22": "You are at full health.",
    "23": "Invalid option.",
    "24": "Your only available location(s) are: ",
    "25": "You have removed {} stone(s)",
    "26": "{}, you are being attacked by a {}.",
    "27": "The soul of your opponent offers you {} {}(s).",
    "28": "You have recieved {} {}(s).",
    "29": "You have rejected {} {}(s).",
    "30": "Invalid option.\nEnter 1 to accept what your opponent is offering\nEnter 2 to reject what your opponent is offering",
    "31": "There are {} stones on the board.",
    "32": "You have won!",
    "33": "You have lost {} health.",
    "34": "\nYou chose Easy difficulty so you will start with a significant amount of gold. Enemy actions are randomized.\n",
    "35": "\nYou chose Medium difficulty so you will start with some extra gold. Enemies will act less random\n",
    "36": "\nYou chose Hard difficulty so you will start with absolutely nothing and enemies are unbeatable withou certain items.\n",
    "37": "The maximum amount of stones you can remove is {}, the minimum is {}.",
    "38": "Unfortunately, you have died. Please try again.",
    "39": "\nThe game has ended.",
    "40": "The {} has taken {} stone(s).",
    "41": "Invalid command.",
    "42": "You have given the alchemist {} {}(s).",
    "43": "'Thank you for your help, here you go - the Shard, as promised.' You now have the Shard, and with it, the ability to teleport to Alberimus's last known location. New location available: prison.",
    "44": "You are in this location already.",
    "45": "The soul of your opponent does not offer you anything.",
    "46": "Enter:\n'i'\t\tto view the contents of your inventory and their amount\n'health'\tto view your current amount of hitpoints\n'heal'\t\tto heal yourself (amount healed is based on the item used for healing)\n'combat'\tto view how combat works in Lizulian Salvation\n'wait'\t\tto wait (can be used in hostile locations to force encounter with local enemy, in non-hostile locations this will do nothing)\n'chooseloc'\tto choose location you want to travel to\n'avalocs'\tto view the list of available locations based on your location\n'h'\t\tto see this message\n'exit'\t\tto exit the game",
    "47": "Invalid command. Enter 'h' to view the full list of possible commands."
}